Documents/ОперацияБух.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ОперацияБух</Name>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВозвратДенежныхСредствПодотчетником</xr:Item>
				<xr:Item>InformationRegister.удалитьРеализацияИтоги</xr:Item>
				<xr:Item>InformationRegister.МестонахождениеОС</xr:Item>
				<xr:Item>InformationRegister.СведенияОбИмуществе</xr:Item>
				<xr:Item>AccumulationRegister.ДвижениеОСНУ</xr:Item>
				<xr:Item>InformationRegister.СтажиСотрудников</xr:Item>
				<xr:Item>AccumulationRegister.ДанныеДляОтчетаРеестрВвезенных</xr:Item>
				<xr:Item>AccumulationRegister.НДС</xr:Item>
				<xr:Item>AccumulationRegister.ДанныеДляОтчетаПоСФЕжемесячному</xr:Item>
				<xr:Item>InformationRegister.СотрудникиПоТрудовымСоглашениям</xr:Item>
				<xr:Item>InformationRegister.АвансыПодотчетника</xr:Item>
				<xr:Item>AccumulationRegister.НалоговыеДекларации</xr:Item>
				<xr:Item>AccumulationRegister.БланкиСчетовФактур</xr:Item>
				<xr:Item>AccumulationRegister.ДвиженияДенежныхСредств</xr:Item>
				<xr:Item>InformationRegister.ТарифыКомандировочных</xr:Item>
				<xr:Item>InformationRegister.НалоговаяВыверка</xr:Item>
				<xr:Item>InformationRegister.СведенияОТранспорте</xr:Item>
				<xr:Item>InformationRegister.ПлановыеНачисленияОкончание</xr:Item>
				<xr:Item>InformationRegister.СостояниеЗаказов</xr:Item>
				<xr:Item>AccumulationRegister.НДСНаИмпорт</xr:Item>
				<xr:Item>InformationRegister.СведенияПоНалогуНаИмущество</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.НДСГТДИмпорт</xr:Item>
				<xr:Item>AccumulationRegister.удалитьРабочееВремяСотрудников</xr:Item>
				<xr:Item>InformationRegister.СчетаФактурыВыписанные</xr:Item>
				<xr:Item>InformationRegister.ПараметрыУчетаОС</xr:Item>
				<xr:Item>AccumulationRegister.ПоступлениеТоваров</xr:Item>
				<xr:Item>InformationRegister.Профвзносы</xr:Item>
				<xr:Item>InformationRegister.НалоговаяАмортизация</xr:Item>
				<xr:Item>InformationRegister.СостоянияОС</xr:Item>
				<xr:Item>AccumulationRegister.НалогиПоЗаработнойПлате</xr:Item>
				<xr:Item>InformationRegister.СобытияОС</xr:Item>
				<xr:Item>AccumulationRegister.ДанныеОтчетаПоПН</xr:Item>
				<xr:Item>AccumulationRegister.ЗемельныйНалог</xr:Item>
				<xr:Item>InformationRegister.ПлановыеУдержанияНачало</xr:Item>
				<xr:Item>InformationRegister.удалитьОценочнаяСтоимостьПоВидамМатериалов</xr:Item>
				<xr:Item>AccumulationRegister.ДанныеДляОтчетаПоСФКвартальному</xr:Item>
				<xr:Item>InformationRegister.СведенияОПоступлении</xr:Item>
				<xr:Item>InformationRegister.ПлановыеНачисленияНачало</xr:Item>
				<xr:Item>AccumulationRegister.ДанныеРеестраГТД</xr:Item>
				<xr:Item>InformationRegister.СтатусыСотрудников</xr:Item>
				<xr:Item>AccumulationRegister.ПодоходныйНалог</xr:Item>
				<xr:Item>AccumulationRegister.СоциальныйФонд</xr:Item>
				<xr:Item>InformationRegister.СчетаФактурыПолученные</xr:Item>
				<xr:Item>AccumulationRegister.ВыплаченнаяЗарплата</xr:Item>
				<xr:Item>InformationRegister.ПлановыеУдержанияОкончание</xr:Item>
				<xr:Item>AccumulationRegister.АвансыДоотгрузка</xr:Item>
				<xr:Item>AccumulationRegister.КорректировкиНУ</xr:Item>
				<xr:Item>InformationRegister.ГНСПоПодразделениям</xr:Item>
				<xr:Item>InformationRegister.ЗначенияСтавокНалоговНДСиНСП</xr:Item>
				<xr:Item>InformationRegister.удалитьСтавкиНалогаНаТранспорт</xr:Item>
				<xr:Item>InformationRegister.СведенияОРаботеСверхурочно</xr:Item>
				<xr:Item>InformationRegister.Сотрудники</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.ВыработкаОС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОперации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗаполнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СторнируемыйДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТиповаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТиповыеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаРегистровСведений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаРегистровНакопления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ОперацияБух/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Устанавливает/снимает признак активности движений документа в зависимости от пометки удаления.
// Следует вызывать перед записью измененной пометки удаления.
// Помеченный на удаление документ не должен иметь активных движений.
// Не помеченный на удаление документ может иметь неактивные движения.
Процедура СинхронизироватьАктивностьДвиженийСПометкойУдаления()
	
	
	Если НЕ ПометкаУдаления 
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПометкаУдаления") = ПометкаУдаления Тогда
		// Не помеченный на удаление документ может иметь неактивные движения.
		// Однако, при снятии пометки удаления все движения становятся активными.
		Возврат;
	КонецЕсли;
	
	Активность = НЕ ПометкаУдаления;
	
	Для Каждого Движение Из Движения Цикл
		
		Если Движение.Записывать = Ложь Тогда // При работе формы набор может быть уже "потроган" (прочитан, модифицирован)
			// Набор никто не трогал
			Движение.Прочитать();
		КонецЕсли;
		
		Для Каждого Строка Из Движение Цикл
			
			Если Строка.Активность = Активность Тогда
				Продолжить;
			КонецЕсли;
			
			Строка.Активность   = Активность;
			Движение.Записывать = Истина; // На случай, если набор был прочитан выше
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьРегистрНакопления(ИмяРегистра)
	
	Если ТаблицаРегистровНакопления.Найти(ИмяРегистра, "Имя") = Неопределено Тогда
		ТаблицаРегистровНакопления.Добавить().Имя = ИмяРегистра;
	КонецЕсли;
	
КонецПроцедуры
		
Процедура ДобавитьРегистрСведений(ИмяРегистра)
	
	Если ТаблицаРегистровСведений.Найти(ИмяРегистра, "Имя") = Неопределено Тогда
		ТаблицаРегистровСведений.Добавить().Имя = ИмяРегистра;
	КонецЕсли;
	
КонецПроцедуры
		
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриКопировании(ОбъектКопирования)

	Дата = НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя());
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеОбъектовБП.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);

	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ТиповыеОперации") Тогда
		ЭтотОбъект.СпособЗаполнения	 = "ТиповаяОперация";
		ЭтотОбъект.ТиповаяОперация	 = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если СпособЗаполнения = "Вручную" Тогда
		ТиповаяОперация      = Неопределено;
		СторнируемыйДокумент = Неопределено;
	ИначеЕсли СтрНайти(СпособЗаполнения, "Сторно") > 0 Тогда
		ТиповаяОперация = Неопределено;
	ИначеЕсли СпособЗаполнения = "ТиповаяОперация" Тогда
		СторнируемыйДокумент = Неопределено;
	КонецЕсли;
	
	// Заполнение даты документа и реквизитов регистров Период и Организация.
	Для каждого НаборЗаписей Из Движения Цикл
		
		Если НаборЗаписей.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ПустаяТаблица   = НаборЗаписей.ВыгрузитьКолонки();
		ЕстьОрганизация = ПустаяТаблица.Колонки.Найти("Организация") <> Неопределено;
		ЕстьПериод      = ПустаяТаблица.Колонки.Найти("Период") <> Неопределено;
		
		Если НЕ (ЕстьОрганизация ИЛИ ЕстьПериод) Тогда
			Продолжить;
		КонецЕсли;
		
		ТаблицаДвижений = НаборЗаписей.Выгрузить();
		Если ЕстьОрганизация Тогда
			ТаблицаДвижений.ЗаполнитьЗначения(Организация, "Организация");
		КонецЕсли;
		Если ЕстьПериод Тогда
			ТаблицаДвижений.ЗаполнитьЗначения(Дата, "Период");
		КонецЕсли;
		НаборЗаписей.Загрузить(ТаблицаДвижений);
		
		// Актуализируем списки регистров
		ИмяРегистра = НаборЗаписей.Метаданные().Имя;
		Если Метаданные.РегистрыНакопления.Содержит(НаборЗаписей.Метаданные()) Тогда
			ДобавитьРегистрНакопления(ИмяРегистра);
		ИначеЕсли Метаданные.РегистрыСведений.Содержит(НаборЗаписей.Метаданные()) Тогда
			ДобавитьРегистрСведений(ИмяРегистра);
		КонецЕсли;
	КонецЦикла;
	
	СинхронизироватьАктивностьДвиженийСПометкойУдаления();
	
КонецПроцедуры // ПередЗаписью()

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив();
	Если СтрНайти(СпособЗаполнения, "Сторно") = 0 Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СторнируемыйДокумент");
	КонецЕсли;
	Если СтрНайти(СпособЗаполнения, "ТиповаяОперация") = 0 Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ТиповаяОперация");
	КонецЕсли;	
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

#КонецЕсли
